performance-tests/load-test.yml
config:
  target: "http://aerolink-alb-1847262488.ap-southeast-1.elb.amazonaws.com:3000"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Warm up"
    - duration: 60
      arrivalRate: 2
      rampTo: 10
      name: "Ramp up"
    - duration: 60
      arrivalRate: 10
      name: "Sustained load"
  payload:
    path: "./payload.csv"
    fields:
      - "flightId"
      - "email"
      - "password"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse flights (public)"
    flow:
      - get:
          url: "/flights"

  - name: "Login and book flight"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            json: "$.token"
            as: "authToken"
      - think: 1
      - post:
          url: "/bookings"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            flightId: "{{ flightId }}"
            passengerEmail: "{{ email }}"
      - think: 1
      - get:
          url: "/flights"