performance-tests/stress-test.yml
config:
  target: "http://aerolink-alb-177713911.ap-southeast-1.elb.amazonaws.com:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: "Ramp to stress"
    - duration: 60
      arrivalRate: 30
      name: "Peak stress"
    - duration: 30
      arrivalRate: 30
      rampTo: 5
      name: "Recovery"
  payload:
    path: "./payload.csv"
    fields:
      - "flightId"
      - "email"
      - "password"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse flights (stress)"
    flow:
      - get:
          url: "/flights"

  - name: "Login and book (stress)"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            json: "$.token"
            as: "authToken"
      - post:
          url: "/bookings"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            flightId: "{{ flightId }}"
            passengerEmail: "{{ email }}"